{
  "22.5": [
    "- Complete UI Overhaul: Enjoy a brand new, cleaner, and more modern interface in both light and dark modes.",
    "- New! Account Stats: A new card on your dashboard tracks your Following, Followers, Reviews, and Review Likes over time with interactive, animated charts.",
    "- Animated Progress Bar: All running tasks now display a vibrant animated progress bar. The animation even pauses when you pause the task.",
    "- Hide Excluded Users: You can now toggle a new setting to hide users from your \"Excluded\" list in the Engagement List table.",
    "- Users on your \"Excluded\" list will now be automatically removed from it if they follow you at a later time.",
    "- Stability Fix: Patched a critical bug that could cause review-liking tasks to hang indefinitely.",
    "- The log drawer will now automatically minimise when you visit the Settings tab (if no task is running) to give you more space.",
    "- And much more... Includes a huge number of under-the-hood bug fixes, performance tweaks, and minor UI polish."
  ],
  "21.8": [
    "- Refined the Light Mode UI for better visual consistency with Dark Mode.",
    "- Resolved inaccurate progress bar reporting for the Automated Follow and Debt Payoff tasks.",
    "- Addressed a Brave Browser bug that caused incorrect date formats for international users.",
    "- Fixed visual alignment bugs on the Results tab and in the Engagement List.",
    "- General under-the-hood stability fixes and optimisations."
  ],
  "21.5": [
    "- Fixed a critical bug which was causing the Automated Mass Follower task to count previously followed users as new.",
    "- Fixed the progress bar for the Auto-Liker, Debt Payoff and Mass Automated Follower tasks so it's more accurate and useful.",
    "- Made the Auto-Focus system switch back to the worker tab as many times as needed instead of only once per session.",
    "- Fixed some UI related bugs"
  ],
  "21.3": [
    "- This update fixes a few more bugs & some visual inconsistencies, and makes the \"Focus Active Tab\" setting affect all tasks which use tabs. Use this setting if you notice tasks slowing down or stalling for no apparent reason (browser throttling)."
  ],
  "21.0": [
    "- Upgraded the Debt Payoff task to run with multiple concurrent tabs, dramatically increasing its processing speed.",
    "- The Review Auto-Liker & Debt Payoff tasks now save their progress, remembering the last page processed for each user to save time on future runs.",
    "- Implemented throttle detection for the Automated Follow task; automatically focuses worker tabs to prevent browser-induced slowdowns.",
    "- Revamped the 24-Hour Activity panel with a new design and expanded stats, now also tracking Review Likes Given and Engagement List Updates.",
    "- Numerous UI and workflow enhancements for a cleaner experience.",
    "- Significant under-the-hood bug fixes and performance optimisations."
  ],
  "20.5": [
    "- This update fixes a few bugs, including an issue with the review auto-liker. Would recommend updating for the best experience."
  ],
  "20.0": [
    "- Major update! Please make sure to create a backup before updating.",
    "- Engagement features have been fully reworked into a new dedicated tab with a rich UI.",
    "- The new table can be sorted by likes given, likes received, and engagement \"Debt\".",
    "- The Review Auto-Liker is now more powerful and integrated directly into the new UI.",
    "- Added the \"Debt Payoff\" task to automatically reciprocate likes to your most active followers.",
    "- Includes numerous bug-fixes and UI improvements for a more stable and polished experience."
  ],
  "19.0": [
    "- Improved onboarding experience with a new welcome screen and the option to restore backups. Please make a backup from the Settings tab before updating.",
    "- Completely redesigned the update modal with a cleaner UI, backup prompts, and a \"How to Update\" guide.",
    "- Added \"Export All to CSV\" and \"Clear All Results\" buttons to the top of the Results tab for easier data management.",
    "- Optimised the Automated Mass Follower for improved speed, while maintaining safe, human-like delays to protect your account.",
    "- Upgraded the live progress display with more detailed, real-time statistics for all automated tasks.",
    "- Numerous bug fixes, logging improvements, and under-the-hood optimisations for enhanced stability and performance."
  ],
  "18.0": [
    "- Added checkboxes to all results lists, allowing users to select specific profiles for batch follow/unfollow actions.",
    "- Enhanced the Review Auto-Liker to process all pages of a user's reviews, not just the first page.",
    "- Implemented rate limit detection for the Review Auto-Liker. The task will now automatically stop to protect your account.",
    "- When you unfollow a user that you originally followed from the 'Engaged' list, they are now automatically added to the Exclusion List.",
    "- The \"Excluded Engaged Users\" list and the \"Persistent Block List\" are now fully manageable from dedicated sections in the Settings tab.",
    "- Resolved multiple bugs and improved overall stability."
  ],
  "17.0": [
    "- Added the Review Auto-Liker, a powerful new tool to automatically like recent reviews from users on your Engagement List.",
    "- Enhanced the Unfollower Finder to include a new, optional results column: \"Engaged users you don't follow\".",
    "- Improved Engagement List management with a new Delete button and an Age Warning setting to help ensure your data is always fresh.",
    "- Automated the Block List: Users who have blocked you are now automatically added to your Block List during Follow tasks.",
    "- Added a Help icon to the header for quick access to the new online user guide.",
    "- Overhauled the User Interface with a cleaner, more balanced layout, a reorganised Settings page, and improved button styles.",
    "- Numerous bug fixes and stability improvements for a smoother user experience."
  ],
  "16.0": [
    "- Introducing Smart Unfollow: A powerful new feature that identifies and unfollows users not engaged with your content by analysing who has liked your reviews.",
    "- The interface has been updated with a light/dark mode theme toggle, a new resizable log drawer, improved scaling on smaller screens, and new tooltips to clarify features.",
    "- You can now pause any running task and resume it later, giving you full control over the process.",
    "- You can now customise the Action Batch Size and Verification Pass Threshold directly in the settings for more granular control over performance and accuracy.",
    "- Backup & Restore: Easily export all your settings and whitelists to a single file for backup, or restore your configuration from an existing file.",
    "- Numerous stability improvements and bug fixes."
  ],
  "15.0": [
    "- Improved the Adaptive Scanner tuning for speed and stability.",
    "- Added live stats to the Unfollower Finder & Automated Mass Follower tasks.",
    "- Added an extra verification step to prevent false positives.",
    "- Improved the Follow/Unfollow All accuracy.",
    "- UI and Log refinements."
  ],
  "14.0": [
    "- Full user interface overhaul, making it less cluttered and more intuitive.",
    "- Automated username detection on first run.",
    "- Numerous bug fixes and improvements."
  ],
  "13.0": [
    "- UI & UX Improvements.",
    "- Speed Improvements.",
    "- Stability Improvements."
  ],
  "12.0": [
    "- Huge speed improvement during the Unfollower Finder scan.",
    "- Most data-gathering tasks now happen silently in the background.",
    "- Added \"Slow mode\" toggle for slower computers or connections."
  ],
  "11.0": [
    "- Added Mass Follower Feature.",
    "- Added Unfollower Finder that supports lists over 6400.",
    "- Huge UI Overhaul.",
    "- Added Update Checker."
  ]
}
